
!
"
#
%
&
'
(
)
*
+
,
-
--
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
\
\!
\"
\#
\$
\%
\&
\'
\(…\)
\,
\.
\/
\:
\;
\=
\>
\AA
\AE
\Alpha
\And
\Arrowvert
\Bbb
\Bbbk
\Beta
\Big
\Bigg
\Biggl
\Biggm
\Biggr
\Bigl
\Bigm
\Bigr
\Box
\Bra
\Bumpeq
\C
\Cap
\Chi
\Colonapprox
\Coloneq
\Coloneqq
\Colonsim
\Complex
\Coppa
\Cup
\Dagger
\Darr
\DeclareMathOperator
\Delta
\Diamond
\Digamma
\Doteq
\Downarrow
\Epsilon
\Eqcolon
\Eqqcolon
\Eta
\Finv
\Game
\Gamma
\H
\Harr
\Huge
\Im
\Iota
\Join
\KaTeX
\Kappa
\Ket
\Koppa
\L
\LARGE
\LaTeX
\Lambda
\Large
\Larr
\LeftArrow
\Leftarrow
\Leftrightarrow
\Lleftarrow
\Longleftarrow
\Longleftrightarrow
\Longrightarrow
\Lrarr
\Lsh
\Mu
\N
\Newextarrow
\Nu
\O
\OE
\Omega
\Omicron
\Overrightarrow
\P
\Phi
\Pi
\Pr
\Psi
\Q
\R
\Rarr
\Re
\Reals
\Rho
\Rightarrow
\Rrightarrow
\Rsh
\Rule
\S
\Sampi
\Sigma
\Space
\Stigma
\Subset
\Supset
\Tau
\TeX
\Theta
\Tiny
\Uarr
\Uparrow
\Updownarrow
\Upsilon
\Vdash
\Vert
\Vvdash
\Xi
\Z
\Zeta
\\
\^
\_
\`
\aa
\above
\abovewithdelims
\acute
\ae
\alef
\alefsym
\aleph
\allowbreak
\alpha
\amalg
\and
\ang
\angl
\angle
\approx
\approxeq
\arccos
\arcctg
\arcsin
\arctan
\arctg
\arg
\argmax
\argmin
\array
\arraystretch
\arrowvert
\ast
\asymp
\atop
\atopwithdelims
\b
\backepsilon
\backprime
\backsim
\backsimeq
\backslash
\bar
\barwedge
\bbox
\bcancel
\because
\begin
\begingroup
\begin{array}
\begin{cases}
\begin{matrix}
\begin{picture}
\beta
\beth
\between
\bf
\bfseries
\big
\bigcap
\bigcirc
\bigcup
\bigg
\biggl
\biggm
\biggr
\bigl
\bigm
\bigodot
\bigominus
\bigoplus
\bigoslash
\bigotimes
\bigr
\bigsqcap
\bigsqcup
\bigstar
\bigtriangledown
\bigtriangleup
\biguplus
\bigvee
\bigwedge
\binom
\blacklozenge
\blacksquare
\blacktriangle
\blacktriangledown
\blacktriangleleft
\blacktriangleright
\bm
\bmod
\bold
\boldmath
\boldsymbol
\bot
\bowtie
\boxdot
\boxed
\boxminus
\boxplus
\boxtimes
\bra
\brace
\bracevert
\brack
\braket
\breve
\buildrel
\bull
\bullet
\bumpeq
\cal
\cancel
\cancelto
\cap
\cases
\cdot
\cdotp
\cdots
\ce
\cee
\centerdot
\cf
\cfrac
\ch
\check
\checkmark
\chi
\choose
\circ
\circeq
\circle
\circlearrowleft
\circlearrowright
\circledR
\circledS
\circledast
\circledcirc
\circleddash
\class
\cline
\clubs
\clubsuit
\cnums
\colon
\colonapprox
\coloneq
\coloneqq
\colonsim
\color
\colorbox
\complement
\cong
\coppa
\coprod
\copyright
\cos
\cosec
\cosh
\cot
\cotg
\coth
\cr
\csc
\cssId
\ctg
\cth
\cup
\curlyeqprec
\curlyeqsucc
\curlyvee
\curlywedge
\curvearrowleft
\curvearrowright
\d
\dArr
\dag
\dagger
\daleth
\darr
\dashleftarrow
\dashrightarrow
\dashv
\dbinom
\dblcolon
\ddag
\ddagger
\ddddot
\dddot
\ddot
\ddots
\def
\definecolor
\deg
\degree
\delta
\det
\dfrac
\diagdown
\diagup
\diamond
\diamonds
\diamondsuit
\digamma
\dim
\displaylines
\displaystyle
\div
\divideontimes
\dot
\doteq
\doteqdot
\dotplus
\dots
\dotsb
\dotsc
\dotsi
\dotsm
\dotso
\doublebarwedge
\doublecap
\doublecup
\downarrow
\downdownarrows
\downharpoonleft
\downharpoonright
\edef
\ell
\else
\em
\emph
\empty
\emptyset
\enclose
\end
\endgroup
\end{array}
\end{cases}
\end{matrix}
\end{picture}
\enskip
\enspace
\epsilon
\eqalign
\eqalignno
\eqcirc
\eqcolon
\eqqcolon
\eqref
\eqsim
\eqslantgtr
\eqslantless
\equiv
\eta
\eth
\euro
\exist
\exists
\exp
\expandafter
\fallingdotseq
\fbox
\fcolorbox
\fi
\flat
\footnotesize
\forall
\frac
\frak
\frown
\futurelet
\gamma
\gcd
\gdef
\ge
\geneuro
\geneuronarrow
\geneurowide
\genfrac
\geq
\geqq
\geqslant
\gets
\gg
\ggg
\gggtr
\gimel
\global
\gnapprox
\gneq
\gneqq
\gnsim
\grave
\gt
\gtrapprox
\gtrdot
\gtreqless
\gtreqqless
\gtrless
\gtrsim
\gvertneqq
\hArr
\harr
\hat
\hbar
\hbox
\hdashline
\hearts
\heartsuit
\hfil
\hfill
\hline
\hom
\hookleftarrow
\hookrightarrow
\hphantom
\hskip
\hslash
\hspace
\huge
\i
\iddots
\idotsint
\if
\iff
\ifmode
\ifx
\iiiint
\iiint
\iint
\image
\imath
\impliedby
\implies
\in
\inf
\infin
\infty
\injlim
\int
\intercal
\intop
\iota
\isin
\it
\itshape
\j
\jmath
\kappa
\ker
\kern
\ket
\koppa
\l
\lArr
\lBrace
\lVert
\label
\lambda
\land
\lang
\langle
\large
\larr
\lbrace
\lbrack
\lceil
\ldotp
\ldots
\le
\leadsto
\left
\left(
\left.
\left<
\left[
\left\langle
\left\lbrack
\left\vert
\left\{
\left\|
\leftarrow
\leftarrowtail
\leftharpoondown
\leftharpoonup
\leftleftarrows
\leftrightarrow
\leftrightarrows
\leftrightharpoons
\leftrightsquigarrow
\leftroot
\leftthreetimes
\left|
\leq
\leqalignno
\leqq
\leqslant
\lessapprox
\lessdot
\lesseqgtr
\lesseqqgtr
\lessgtr
\lesssim
\let
\lfloor
\lg
\lgroup
\lhd
\lim
\liminf
\limits
\limsup
\line
\ll
\llap
\llbracket
\llcorner
\lll
\llless
\lmoustache
\ln
\lnapprox
\lneq
\lneqq
\lnot
\lnsim
\log
\long
\longleftarrow
\longleftrightarrow
\longmapsto
\longrightarrow
\looparrowleft
\looparrowright
\lor
\lower
\lozenge
\lparen
\lq
\lrArr
\lrarr
\lrcorner
\lt
\ltimes
\lvert
\lvertneqq
\makebox
\maltese
\mapsto
\mathbb
\mathbf
\mathbin
\mathcal
\mathchoice
\mathclap
\mathclose
\mathellipsis
\mathfrak
\mathinner
\mathit
\mathllap
\mathnormal
\mathop
\mathopen
\mathord
\mathpunct
\mathrel
\mathring
\mathrlap
\mathrm
\mathscr
\mathsf
\mathsterling
\mathstrut
\mathtip
\mathtt
\matrix
\max
\mbox
\md
\mdseries
\measuredangle
\medspace
\mho
\mid
\middle
\min
\minuso
\mit
\mkern
\mmlToken
\mod
\models
\moveleft
\moveright
\mp
\mskip
\mspace
\mu
\multicolumn
\multimap
\nLeftarrow
\nLeftrightarrow
\nRightarrow
\nVDash
\nVdash
\nabla
\natnums
\natural
\ncong
\ne
\nearrow
\neg
\negmedspace
\negthickspace
\negthinspace
\neq
\newcommand
\newenvironment
\newline
\nexists
\ngeq
\ngeqq
\ngeqslant
\ngtr
\ni
\nleftarrow
\nleftrightarrow
\nleq
\nleqq
\nleqslant
\nless
\nmid
\noalign
\nobreak
\nobreakspace
\noexpand
\nolimits
\nonumber
\normalfont
\normalsize
\not
\notag
\notin
\notni
\nparallel
\nprec
\npreceq
\nrightarrow
\nshortmid
\nshortparallel
\nsim
\nsubseteq
\nsubseteqq
\nsucc
\nsucceq
\nsupseteq
\nsupseteqq
\ntriangleleft
\ntrianglelefteq
\ntriangleright
\ntrianglerighteq
\nu
\nvDash
\nvdash
\nwarrow
\o
\odot
\oe
\officialeuro
\oiiint
\oiint
\oint
\oldstyle
\omega
\omicron
\ominus
\operatorname
\operatorname*
\oplus
\or
\oslash
\otimes
\over
\overbrace
\overbracket
\overgroup
\overleftarrow
\overleftharpoon
\overleftrightarrow
\overline
\overlinesegment
\overparen
\overrightarrow
\overrightharpoon
\overset
\overwithdelims
\owns
\pagecolor
\parallel
\part
\partial
\perp
\phantom
\phase
\phi
\pi
\pitchfork
\plim
\plusmn
\pm
\pmatrix
\pmb
\pmod
\pod
\pounds
\prec
\precapprox
\preccurlyeq
\preceq
\precnapprox
\precneqq
\precnsim
\precsim
\prime
\prod
\projlim
\propto
\protect
\providecommand
\psi
\pu
\put
\qquad
\quad
\r
\rArr
\rBrace
\rVert
\raise
\raisebox
\rang
\rangle
\rarr
\rbrace
\rbrack
\rceil
\real
\reals
\ref
\relax
\renewcommand
\renewenvironment
\require
\restriction
\rfloor
\rgroup
\rhd
\rho
\right
\right)
\right.
\right>
\right\rangle
\right\rbrack
\right\vert
\right\|
\right\}
\right]
\rightarrow
\rightarrowtail
\rightharpoondown
\rightharpoonup
\rightleftarrows
\rightleftharpoons
\rightrightarrows
\rightsquigarrow
\rightthreetimes
\right|
\risingdotseq
\rlap
\rm
\rmoustache
\root
\rotatebox
\rparen
\rq
\rrbracket
\rtimes
\rule
\rvert
\sampi
\sb
\sc
\scalebox
\scr
\scriptscriptstyle
\scriptsize
\scriptstyle
\sdot
\searrow
\sec
\sect
\setlength
\setminus
\sf
\sh
\sharp
\shortmid
\shortparallel
\shoveleft
\shoveright
\sideset
\sigma
\sim
\simeq
\sin
\sinh
\sixptsize
\skew
\skip
\sl
\slash
\small
\smallfrown
\smallint
\smallsetminus
\smallskip
\smallsmile
\smash
\smile
\smiley
\sout
\sp
\space
\spades
\spadesuit
\sphericalangle
\sqcap
\sqcup
\sqrt
\sqsubset
\sqsubseteq
\sqsupset
\sqsupseteq
\square
\ss
\stackrel
\star
\stigma
\strut
\style
\sub
\sube
\subset
\subseteq
\subseteqq
\subsetneq
\subsetneqq
\substack
\succ
\succapprox
\succcurlyeq
\succeq
\succnapprox
\succneqq
\succnsim
\succsim
\sum
\sup
\supe
\supset
\supseteq
\supseteqq
\supsetneq
\supsetneqq
\surd
\swarrow
\tag
\tag*
\tan
\tanh
\tau
\tbinom
\text
\textasciicircum
\textasciitilde
\textbackslash
\textbar
\textbardbl
\textbf
\textbraceleft
\textbraceright
\textcircled
\textcolor
\textdagger
\textdaggerdbl
\textdegree
\textdollar
\textellipsis
\textemdash
\textendash
\textgreater
\textit
\textless
\textmd
\textnormal
\textquotedblleft
\textquotedblright
\textquoteleft
\textquoteright
\textregistered
\textrm
\textsc
\textsf
\textsl
\textsterling
\textstyle
\texttip
\texttt
\textunderscore
\textup
\textvisiblespace
\tfrac
\tg
\th
\therefore
\theta
\thetasym
\thickapprox
\thicksim
\thickspace
\thinspace
\tilde
\times
\tiny
\to
\toggle
\top
\triangle
\triangledown
\triangleleft
\trianglelefteq
\triangleq
\triangleright
\trianglerighteq
\tt
\twoheadleftarrow
\twoheadrightarrow
\u
\uArr
\uarr
\ulcorner
\underbrace
\underbracket
\undergroup
\underleftarrow
\underleftrightarrow
\underline
\underlinesegment
\underparen
\underrightarrow
\underset
\unicode
\unitlength
\unlhd
\unrhd
\up
\uparrow
\updownarrow
\upharpoonleft
\upharpoonright
\uplus
\uproot
\upshape
\upsilon
\upuparrows
\urcorner
\url
\utilde
\v
\vDash
\varDelta
\varGamma
\varLambda
\varOmega
\varPhi
\varPi
\varPsi
\varSigma
\varTheta
\varUpsilon
\varXi
\varcoppa
\varepsilon
\varinjlim
\varkappa
\varliminf
\varlimsup
\varnothing
\varphi
\varpi
\varprojlim
\varpropto
\varrho
\varsigma
\varstigma
\varsubsetneq
\varsubsetneqq
\varsupsetneq
\varsupsetneqq
\vartheta
\vartriangle
\vartriangleleft
\vartriangleright
\vcentcolon
\vcenter
\vdash
\vdots
\vec
\vee
\veebar
\verb
\vert
\vfil
\vfill
\vline
\vphantom
\vspace
\wedge
\weierp
\widecheck
\widehat
\wideparen
\widetilde
\wp
\wr
\xLeftarrow
\xLeftrightarrow
\xRightarrow
\xcancel
\xdef
\xhookleftarrow
\xhookrightarrow
\xi
\xleftarrow
\xleftharpoondown
\xleftharpoonup
\xleftrightarrow
\xleftrightharpoons
\xlongequal
\xmapsto
\xrightarrow
\xrightharpoondown
\xrightharpoonup
\xrightleftharpoons
\xtofrom
\xtwoheadleftarrow
\xtwoheadrightarrow
\yen
\zeta
\{
\|
\}
\~
]
^
_
`
a
b
c
d
e
f
g
h
i
instead
j
k
l
m
n
o
p
q
r
s
t
u
use
v
w
x
y
z
{
|
}
~