!
"
#
%
&
'
(
)
*
+
,
-
--
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
\
\!
\"
\#
\$
\%
\&
\'
\(…\)
\,
\.
\/
\:
\;
\=
\>
\AA
\AE
\Alpha
\And
\Arrowvert
\Bbb
\Bbbk
\Beta
\Big
\Bigg
\Biggl
\Biggm
\Biggr
\Bigl
\Bigm
\Bigr
\Box
\Bra
\Bumpeq
\C
\Cap
\Chi
\Colonapprox
\Coloneq
\Coloneqq
\Colonsim
\Complex
\Coppa
\Cup
\Dagger
\Darr
\DeclareMathOperator
\Delta
\Diamond
\Digamma
\Doteq
\Downarrow
\Epsilon
\Eqcolon
\Eqqcolon
\Eta
\Finv
\Game
\Gamma
\H
\Harr
\Huge
\Im
\Iota
\Join
\Kappa
\Ket
\Koppa
\L
\LARGE
\Lambda
\Large
\Larr
\LeftArrow
\Leftarrow
\Leftrightarrow
\Lleftarrow
\Longleftarrow
\Longleftrightarrow
\Longrightarrow
\Lrarr
\Lsh
\Mu
\N
\Newextarrow
\Nu
\O
\OE
\Omega
\Omicron
\Overrightarrow
\P
\Phi
\Pi
\Pr
\Psi
\Q
\R
\Rarr
\Re
\Reals
\Rho
\Rightarrow
\Rrightarrow
\Rsh
\Rule
\S
\Sampi
\Sigma
\Space
\Stigma
\Subset
\Supset
\Tau
\TeX
\Theta
\Tiny
\Uarr
\Uparrow
\Updownarrow
\Upsilon
\Vdash
\Vert
\Vvdash
\Xi
\Z
\Zeta
\\
\^
\_
\`
\aa
\above
\abovewithdelims
\acute
\ae
\alef
\alefsym
\aleph
\allowbreak
\alpha
\amalg
\and
\ang
\angl
\angle
\approx
\approxeq
\arccos
\arcctg
\arcsin
\arctan
\arctg
\arg
\argmax
\argmin
\array
\arraystretch
\arrowvert
\ast
\asymp
\atop
\atopwithdelims
\b
\backepsilon
\backprime
\backsim
\backsimeq
\backslash
\bar
\barwedge
\bbox
\bcancel
\because
\begin
\begingroup
\begin{array}
\begin{cases}
\begin{matrix}
\begin{picture}
\beta
\beth
\between
\bf
\bfseries
\big
\bigcap
\bigcirc
\bigcup
\bigg
\biggl
\biggm
\biggr
\bigl
\bigm
\bigodot
\bigominus
\bigoplus
\bigoslash
\bigotimes
\bigr
\bigsqcap
\bigsqcup
\bigstar
\bigtriangledown
\bigtriangleup
\biguplus
\bigvee
\bigwedge
\binom
\blacklozenge
\blacksquare
\blacktriangle
\blacktriangledown
\blacktriangleleft
\blacktriangleright
\bm
\bmod
\bold
\boldmath
\boldsymbol
\bot
\bowtie
\boxdot
\boxed
\boxminus
\boxplus
\boxtimes
\bra
\brace
\bracevert
\brack
\braket
\breve
\buildrel
\bull
\bullet
\bumpeq
\cal
\cancel
\cancelto
\cap
\cases
\cdot
\cdotp
\cdots
\ce
\cee
\centerdot
\cf
\cfrac
\ch
\check
\checkmark
\chi
\choose
\circ
\circeq
\circle
\circlearrowleft
\circlearrowright
\circledR
\circledS
\circledast
\circledcirc
\circleddash
\class
\cline
\clubs
\clubsuit
\cnums
\colon
\colonapprox
\coloneq
\coloneqq
\colonsim
\color
\colorbox
\complement
\cong
\coppa
\coprod
\copyright
\cos
\cosec
\cosh
\cot
\cotg
\coth
\cr
\csc
\cssId
\ctg
\cth
\cup
\curlyeqprec
\curlyeqsucc
\curlyvee
\curlywedge
\curvearrowleft
\curvearrowright
\d
\dArr
\dag
\dagger
\daleth
\darr
\dashleftarrow
\dashrightarrow
\dashv
\dbinom
\dblcolon
\ddag
\ddagger
\ddddot
\dddot
\ddot
\ddots
\def
\definecolor
\deg
\degree
\delta
\det
\dfrac
\diagdown
\diagup
\diamond
\diamonds
\diamondsuit
\digamma
\dim
\displaylines
\displaystyle
\div
\divideontimes
\dot
\doteq
\doteqdot
\dotplus
\dots
\dotsb
\dotsc
\dotsi
\dotsm
\dotso
\doublebarwedge
\doublecap
\doublecup
\downarrow
\downdownarrows
\downharpoonleft
\downharpoonright
\edef
\ell
\else
\em
\emph
\empty
\emptyset
\enclose
\end
\endgroup
\end{array}
\end{cases}
\end{matrix}
\end{picture}
\enskip
\enspace
\epsilon
\eqalign
\eqalignno
\eqcirc
\eqcolon
\eqqcolon
\eqref
\eqsim
\eqslantgtr
\eqslantless
\equiv
\eta
\eth
\euro
\exist
\exists
\exp
\expandafter
\fallingdotseq
\fbox
\fcolorbox
\fi
\flat
\footnotesize
\forall
\frac
\frak
\frown
\futurelet
\gamma
\gcd
\gdef
\ge
\geneuro
\geneuronarrow
\geneurowide
\genfrac
\geq
\geqq
\geqslant
\gets
\gg
\ggg
\gggtr
\gimel
\global
\gnapprox
\gneq
\gneqq
\gnsim
\grave
\gt
\gtrapprox
\gtrdot
\gtreqless
\gtreqqless
\gtrless
\gtrsim
\gvertneqq
\hArr
\harr
\hat
\hbar
\hbox
\hdashline
\hearts
\heartsuit
\hfil
\hfill
\hline
\hom
\hookleftarrow
\hookrightarrow
\hphantom
\hskip
\hslash
\hspace
\huge
\i
\iddots
\idotsint
\if
\iff
\ifmode
\ifx
\iiiint
\iiint
\iint
\image
\imath
\impliedby
\implies
\in
\inf
\infin
\infty
\injlim
\int
\intercal
\intop
\iota
\isin
\it
\itshape
\j
\jmath
\kappa
\ker
\kern
\ket
\koppa
\l
\lArr
\lBrace
\lVert
\label
\lambda
\land
\lang
\langle
\large
\larr
\lbrace
\lbrack
\lceil
\ldotp
\ldots
\le
\leadsto
\left
\left(
\left.
\left<
\left[
\left\langle
\left\lbrack
\left\vert
\left\{
\left\|
\leftarrow
\leftarrowtail
\leftharpoondown
\leftharpoonup
\leftleftarrows
\leftrightarrow
\leftrightarrows
\leftrightharpoons
\leftrightsquigarrow
\leftroot
\leftthreetimes
\left|
\leq
\leqalignno
\leqq
\leqslant
\lessapprox
\lessdot
\lesseqgtr
\lesseqqgtr
\lessgtr
\lesssim
\let
\lfloor
\lg
\lgroup
\lhd
\lim
\liminf
\limits
\limsup
\line
\ll
\llap
\llbracket
\llcorner
\lll
\llless
\lmoustache
\ln
\lnapprox
\lneq
\lneqq
\lnot
\lnsim
\log
\long
\longleftarrow
\longleftrightarrow
\longmapsto
\longrightarrow
\looparrowleft
\looparrowright
\lor
\lower
\lozenge
\lparen
\lq
\lrArr
\lrarr
\lrcorner
\lt
\ltimes
\lvert
\lvertneqq
\makebox
\maltese
\mapsto
\mathbb
\mathbf
\mathbin
\mathcal
\mathchoice
\mathclap
\mathclose
\mathellipsis
\mathfrak
\mathinner
\mathit
\mathllap
\mathnormal
\mathop
\mathopen
\mathord
\mathpunct
\mathrel
\mathring
\mathrlap
\mathrm
\mathscr
\mathsf
\mathsterling
\mathstrut
\mathtip
\mathtt
\matrix
\max
\mbox
\md
\mdseries
\measuredangle
\medspace
\mho
\mid
\middle
\min
\minuso
\mit
\mkern
\mmlToken
\mod
\models
\moveleft
\moveright
\mp
\mskip
\mspace
\mu
\multicolumn
\multimap
\nLeftarrow
\nLeftrightarrow
\nRightarrow
\nVDash
\nVdash
\nabla
\natnums
\natural
\ncong
\ne
\nearrow
\neg
\negmedspace
\negthickspace
\negthinspace
\neq
\newcommand
\newenvironment
\newline
\nexists
\ngeq
\ngeqq
\ngeqslant
\ngtr
\ni
\nleftarrow
\nleftrightarrow
\nleq
\nleqq
\nleqslant
\nless
\nmid
\noalign
\nobreak
\nobreakspace
\noexpand
\nolimits
\nonumber
\normalfont
\normalsize
\not
\notag
\notin
\notni
\nparallel
\nprec
\npreceq
\nrightarrow
\nshortmid
\nshortparallel
\nsim
\nsubseteq
\nsubseteqq
\nsucc
\nsucceq
\nsupseteq
\nsupseteqq
\ntriangleleft
\ntrianglelefteq
\ntriangleright
\ntrianglerighteq
\nu
\nvDash
\nvdash
\nwarrow
\o
\odot
\oe
\officialeuro
\oiiint
\oiint
\oint
\oldstyle
\omega
\omicron
\ominus
\operatorname
\operatorname*
\oplus
\or
\oslash
\otimes
\over
\overbrace
\overbracket
\overgroup
\overleftarrow
\overleftharpoon
\overleftrightarrow
\overline
\overlinesegment
\overparen
\overrightarrow
\overrightharpoon
\overset
\overwithdelims
\owns
\pagecolor
\parallel
\part
\partial
\perp
\phantom
\phase
\phi
\pi
\pitchfork
\plim
\plusmn
\pm
\pmatrix
\pmb
\pmod
\pod
\pounds
\prec
\precapprox
\preccurlyeq
\preceq
\precnapprox
\precneqq
\precnsim
\precsim
\prime
\prod
\projlim
\propto
\protect
\providecommand
\psi
\pu
\put
\qquad
\quad
\r
\rArr
\rBrace
\rVert
\raise
\raisebox
\rang
\rangle
\rarr
\rbrace
\rbrack
\rceil
\real
\reals
\ref
\relax
\renewcommand
\renewenvironment
\require
\restriction
\rfloor
\rgroup
\rhd
\rho
\right
\right)
\right.
\right>
\right\rangle
\right\rbrack
\right\vert
\right\|
\right\}
\right]
\rightarrow
\rightarrowtail
\rightharpoondown
\rightharpoonup
\rightleftarrows
\rightleftharpoons
\rightrightarrows
\rightsquigarrow
\rightthreetimes
\right|
\risingdotseq
\rlap
\rm
\rmoustache
\root
\rotatebox
\rparen
\rq
\rrbracket
\rtimes
\rule
\rvert
\sampi
\sb
\sc
\scalebox
\scr
\scriptscriptstyle
\scriptsize
\scriptstyle
\sdot
\searrow
\sec
\sect
\setlength
\setminus
\sf
\sh
\sharp
\shortmid
\shortparallel
\shoveleft
\shoveright
\sideset
\sigma
\sim
\simeq
\sin
\sinh
\sixptsize
\skew
\skip
\sl
\slash
\small
\smallfrown
\smallint
\smallsetminus
\smallskip
\smallsmile
\smash
\smile
\smiley
\sout
\sp
\space
\spades
\spadesuit
\sphericalangle
\sqcap
\sqcup
\sqrt
\sqsubset
\sqsubseteq
\sqsupset
\sqsupseteq
\square
\ss
\stackrel
\star
\stigma
\strut
\style
\sub
\sube
\subset
\subseteq
\subseteqq
\subsetneq
\subsetneqq
\substack
\succ
\succapprox
\succcurlyeq
\succeq
\succnapprox
\succneqq
\succnsim
\succsim
\sum
\sup
\supe
\supset
\supseteq
\supseteqq
\supsetneq
\supsetneqq
\surd
\swarrow
\tag
\tag*
\tan
\tanh
\tau
\tbinom
\text
\textasciicircum
\textasciitilde
\textbackslash
\textbar
\textbardbl
\textbf
\textbraceleft
\textbraceright
\textcircled
\textcolor
\textdagger
\textdaggerdbl
\textdegree
\textdollar
\textellipsis
\textemdash
\textendash
\textgreater
\textit
\textless
\textmd
\textnormal
\textquotedblleft
\textquotedblright
\textquoteleft
\textquoteright
\textregistered
\textrm
\textsc
\textsf
\textsl
\textsterling
\textstyle
\texttip
\texttt
\textunderscore
\textup
\textvisiblespace
\tfrac
\tg
\th
\therefore
\theta
\thetasym
\thickapprox
\thicksim
\thickspace
\thinspace
\tilde
\times
\tiny
\to
\toggle
\top
\triangle
\triangledown
\triangleleft
\trianglelefteq
\triangleq
\triangleright
\trianglerighteq
\tt
\twoheadleftarrow
\twoheadrightarrow
\u
\uArr
\uarr
\ulcorner
\underbrace
\underbracket
\undergroup
\underleftarrow
\underleftrightarrow
\underline
\underlinesegment
\underparen
\underrightarrow
\underset
\unicode
\unitlength
\unlhd
\unrhd
\up
\uparrow
\updownarrow
\upharpoonleft
\upharpoonright
\uplus
\uproot
\upshape
\upsilon
\upuparrows
\urcorner
\url
\utilde
\v
\vDash
\varDelta
\varGamma
\varLambda
\varOmega
\varPhi
\varPi
\varPsi
\varSigma
\varTheta
\varUpsilon
\varXi
\varcoppa
\varepsilon
\varinjlim
\varkappa
\varliminf
\varlimsup
\varnothing
\varphi
\varpi
\varprojlim
\varpropto
\varrho
\varsigma
\varstigma
\varsubsetneq
\varsubsetneqq
\varsupsetneq
\varsupsetneqq
\vartheta
\vartriangle
\vartriangleleft
\vartriangleright
\vcentcolon
\vcenter
\vdash
\vdots
\vec
\vee
\veebar
\verb
\vert
\vfil
\vfill
\vline
\vphantom
\vspace
\wedge
\weierp
\widecheck
\widehat
\wideparen
\widetilde
\wp
\wr
\xLeftarrow
\xLeftrightarrow
\xRightarrow
\xcancel
\xdef
\xhookleftarrow
\xhookrightarrow
\xi
\xleftarrow
\xleftharpoondown
\xleftharpoonup
\xleftrightarrow
\xleftrightharpoons
\xlongequal
\xmapsto
\xrightarrow
\xrightharpoondown
\xrightharpoonup
\xrightleftharpoons
\xtofrom
\xtwoheadleftarrow
\xtwoheadrightarrow
\yen
\zeta
\{
\|
\}
\~
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~
照
博
间
不
他
还
赵
付
跳
底
铰
很
漩
危
填
免
超
绿
钟
餐
抗
泡
观
晶
却
甲
中
促
植
序
整
虑
框
式
轻
扫
仪
节
味
慢
氧
公
姨
计
增
趋
车
散
滤
否
控
染
爽
载
疑
民
盖
人
篷
咜
募
着
峰
委
于
要
伸
乾
统
疗
水
研
矨
敏
巩
罗
斤
庄
圃
叠
这
川
检
添
断
面
梯
布
越
到
常
话
员
橘
茶
浬
珠
圈
饰
政
起
斜
名
发
言
暑
资
己
画
棒
销
究
途
菊
宿
逐
购
谚
把
行
终
下
绝
拥
稀
耦
续
农
深
享
助
探
左
老
低
议
猜
丈
或
张
综
精
恒
摄
洞
岛
告
况
已
旧
厚
第
床
炼
诊
稻
务
为
材
失
类
关
烟
菜
改
年
同
持
牌
惠
仴
示
措
推
业
渐
土
古
逃
乘
景
度
临
坚
减
季
捞
浙
米
么
给
咸
够
缺
应
央
寻
导
殖
鉴
返
旬
漠
史
受
察
层
众
刖
伟
芯
根
短
剧
上
片
菱
体
款
折
感
融
灯
向
扇
肥
邮
津
患
糖
访
弦
岗
答
靠
攻
桯
展
良
健
妨
顺
庭
济
说
竹
园
均
握
便
税
那
拉
弹
冰
俯
灾
仰
油
志
累
但
猫
令
表
净
死
匀
残
厅
教
外
柳
航
煤
丙
难
依
参
乙
池
率
易
原
唐
写
随
猪
滕
决
早
德
铁
黑
别
美
练
币
靶
硬
格
混
母
求
粽
满
气
镇
盛
炎
暴
效
闱
干
市
电
售
陕
长
偶
路
宋
善
交
校
考
造
斐
洲
亩
充
亮
链
距
凡
朝
卵
肯
状
岺
午
球
虽
晚
纵
值
收
花
门
赤
挥
用
男
墙
粉
科
做
尝
匹
降
支
运
传
滴
域
非
师
器
般
励
港
吸
兮
亡
送
象
旅
换
春
获
评
恰
少
算
腋
本
差
限
保
地
蟹
新
元
霓
叶
藏
没
呈
谐
存
供
冬
础
件
划
菇
装
盒
赏
子
波
圾
典
阳
罩
首
分
北
闰
寓
仍
盆
瓦
塔
采
宫
如
欢
皮
坝
福
谈
乓
红
瓶
柱
雌
蛋
此
糸
替
近
荤
设
粒
脐
户
扡
历
策
先
键
软
叫
零
操
姑
幅
颜
竎
开
尖
密
问
六
馆
创
播
液
客
哈
高
监
记
端
岁
职
燃
著
株
厘
脑
需
防
活
场
基
饵
有
何
胖
宁
题
冲
卯
豆
索
凸
只
疫
苗
熊
白
田
试
十
往
栽
脱
热
商
刻
掷
储
腊
驾
口
堵
联
相
些
剩
和
倾
橙
停
益
炬
撤
版
剂
激
牟
思
例
卡
骰
项
避
蔬
龄
司
秒
猎
蓝
证
反
雉
迷
准
误
暂
招
吨
取
置
克
舰
初
狼
横
营
移
部
既
胜
个
辆
刷
繁
虹
缩
铯
欲
离
架
期
翻
品
细
影
汽
判
东
身
浴
就
价
劣
票
契
专
筑
阴
届
柄
京
雄
斯
艺
朋
冈
入
读
糕
督
翼
鼠
妆
勾
瞄
变
属
似
马
插
箱
必
温
衡
际
欧
河
验
兹
界
涨
遇
音
速
幂
纯
理
游
轮
档
阶
复
异
居
奥
图
捕
徽
平
动
损
艘
征
闯
转
仵
申
血
擎
集
九
涂
报
吏
玹
炮
印
噪
逆
贫
二
系
村
性
礼
末
瞬
豚
星
淳
室
质
约
领
按
秀
刚
注
丁
股
迎
犯
拋
候
且
叔
等
库
搭
困
始
扣
讲
青
嵌
唯
墩
法
冠
火
木
段
占
查
熟
旦
涅
棵
让
列
碰
简
浓
露
馅
碳
籿
苹
引
选
回
源
四
摸
即
戏
雨
延
曲
矛
区
函
手
远
料
网
定
叹
共
果
紫
编
包
智
情
当
座
腰
废
径
启
括
提
述
蓄
颗
骨
方
维
择
挂
喜
雕
以
坐
投
吃
仿
护
达
较
歫
抛
及
过
附
摆
强
测
射
臑
块
毫
栋
亏
线
桥
卫
雪
缴
经
王
侧
喿
被
功
立
狩
帽
夙
咖
都
认
万
割
其
铝
技
宅
产
酸
日
鼓
每
久
将
予
流
培
套
烹
析
脃
点
环
排
疾
施
了
特
州
穿
妈
乒
棍
互
西
指
劳
堂
台
抓
梅
振
桃
帐
小
单
级
食
赫
罚
南
书
鳖
化
调
药
湖
今
文
具
歌
好
道
管
预
无
骑
呼
通
结
垂
痕
岸
百
围
鞠
兔
漏
登
瘦
华
肴
确
态
空
珍
革
演
递
故
房
钝
事
璃
训
而
像
养
风
费
玩
杯
心
实
天
的
极
暗
跑
缆
漆
纤
希
坤
得
赢
视
赋
坛
待
怀
签
眼
奔
寿
连
矩
进
官
香
庆
五
见
世
泳
败
岳
构
殊
许
辐
城
奇
梦
广
响
诞
右
寸
治
倍
女
迹
穷
缓
才
正
站
企
伏
号
家
若
举
齐
盘
可
知
封
频
宗
从
帝
自
又
国
援
止
安
偏
铅
厂
压
童
形
更
虫
夘
光
描
条
育
污
厷
也
歼
制
纪
枚
树
椭
放
生
月
板
绍
织
假
绳
亦
允
透
稳
友
然
三
真
完
赔
隔
升
前
全
学
盏
显
煮
跌
咬
幸
会
办
虚
医
赠
搏
伤
字
飞
玻
对
容
作
批
杆
扑
补
船
奖
另
型
贝
团
直
服
加
昌
积
卖
信
在
舞
耗
拟
带
普
班
趣
昆
各
绩
能
七
锥
畅
宣
论
仅
浮
标
击
泉
杄
程
卷
群
们
尺
头
夏
冷
壁
工
楼
边
轨
义
是
雷
因
愈
堑
险
内
弱
境
蒂
金
映
肺
狗
愿
素
明
快
步
桶
范
草
幕
圆
芽
鱼
偿
宜
银
闭
规
润
纬
术
厦
英
宽
舍
黄
重
货
订
奉
周
备
掉
介
鲜
现
望
桌
林
优
所
租
箭
祖
顶
消
社
茎
召
出
熵
尔
课
命
抽
李
错
数
摘
太
配
符
量
则
彩
酒
派
执
店
针
与
宾
斥
使
嘉
遍
阵
色
县
病
语
大
阅
臂
裁
看
军
输
沙
比
贵
轴
代
成
山
脉
潮
垄
螃
局
牛
借
打
半
扶
辅
某
落
旋
多
建
省
裂
利
宛
橫
解
衰
者
绕
额
概
案
请
该
总
束
棚
至
石
想
邻
截
意
滑
码
券
由
街
锐
几
切
覆
桂
纸
戊
机
识
八
归
位
帮
袋
最
乡
椅
沿
样
揭
碑
驶
住
爱
淡
轭
啡
脚
处
凌
未
合
组
略
孔
详
独
须
鸣
篮
兴
儿
榫
江
纳
负
微
目
留
后
接
痛
亿
角
足
阿
任
殳
再
固
讨
它
什
谷
录
次
弧
责
海
背
焦
士
修
去
震
塘
筒
威
找
物
一
队
钱
郑
院
除
里
赛
竞
释
孩
千
主
障
份
锻
佳
棱
饭
贷
声
走
来
模
估
蟋
称
盾
时
彼
哪
袮
含
买
循
余
之
夹
乐
毒
肉
顾
力
晏
康
崝
核
并
据
捐
蟀
巵
垃
饮
律
搜
息
倒
种
习
猴
致
双
我
副
两
惊